Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresSettings.ToolOptionNames.RebarGroup Field
 The rebar group.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public const string RebarGroup = "sel_rebar_group"
Public Const RebarGroup As String = "sel_rebar_group"
Field Value
Type: String
See Also
Reference
TeklaStructuresSettings.ToolOptionNames Class
Tekla.Structures Namespace